IDEA StatiCa Open Model
ReinfBarByTwoPoints.MasterComponent2 Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Second master component of reinforcement
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement MasterComponent2 { get; set; }
Public Property MasterComponent2 As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ MasterComponent2 {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
ReinfBarByTwoPoints Class
IdeaRS.OpenModel.Detail Namespace